[
  {
    "title": "Machine Learning Audience Generator",
    "description": "Find the right audience for marketing",
    "image": "/projectImages/Generator.png",
    "image2": "/projectImages/audience.jpg",
    "image3": "/projectImages/AMWTech.jpg",
    "body": "Built an audience generator to create audience based on user entered keyword. Using the keyword the data was searched live using social media APIs of Reddit, X, Youtube and then collected Ethically. \nThe raw data which contained reddit posts and comments, youtube comments, tweets are then preprocessed using various preprocessing techniques such as lemmatisation, removal stop words and explicit words.  This pre processed data is then sent to the Roberta based transformer model which was trained on 124M tweets for sentiment analysis. \nBased on the result from the model all the data with the positive sentiment are considered right audience and the details of individual who posted that data is then stored in the database which can be used for future marketing. This Project is ideal for marketers, researchers, and social media managers looking to engage with a positively inclined audience.",
    "technologies": ["Python", "NLP", "Roberta", "HTML", "CSS"],
    "github": "https://github.com/Exynos13/Social_Media_Audience_Generator",
    "bgcolor": "var(--hl2-color)",
    "id": "1"
  },
  {
    "title": "Explainable Credit risk Prediction",
    "description": "Credit risk calculation with reasoning",
    "image": "/projectImages/weather.png",
    "image2": "/projectImages/creditrisk1.jpg",
    "image3": "/projectImages/creditrisk.jpg",
    "technologies": ["Python", "Flask", "Heroku", "ML", "HTML", "CSS"],
    "body": "This website can be used to calculate the credit risk of a user using multiple machine learning algorithms, but unlike other similar prediction tools with a blackbox prediction emphasis was put on identifying the main contributing factors and reasoning for why the given decision was predicted . \nfor the users with elevated risk ratings, various mitigation plans can be offered to reduce the risk they pose to a business ",
    "github": "https://github.com/Exynos13/CSIDS-Finance",
    "bgcolor": "var(--hl-color)",
    "id": "2"
  },
  {
    "title": "Tableau Projects",
    "description": "Tableau Dashboards",
    "image": "/projectImages/Dashboard.png",
    "image2": "/projectImages/Tableau.png",
    "image3": "/projectImages/Dashboard1.png",
    "technologies": ["Data Preprocessing", "Data Analysis", "Reports", "Dashboards"],
    "body": "Some of my tableau projects where I have successfully created and managed Tableau workbooks to analyze and extract valuable insights from complex datasets. \n Constructed comprehensive dashboards by combining multiple visualizations, providing a cohesive and holistic view of the data. Designed user-friendly and interactive dashboards with elements like filters, highlighters, and action controls, enabling users to explore the data and drill down into specific details.",
    "github": "https://github.com/Exynos13/Tableau_Projects",
    "bgcolor": "#6c4bf4",
    "id": "3"
  },
  {
    "title": "Facial Emotion Detection",
    "description": "Emotion Detection using image inputs",
    "image": "/projectImages/emotion.png",
    "image2": "/projectImages/Emotion_Detection.png",
    "image3": "/projectImages/Detection.png",
    "technologies": ["Data Preprocessing", "Image Processing","Deep Learning", "Machine Learning", "Transfer Learning"],
    "body": "Developed a end-to-end trained deep convolutional neural network (CNN) to be able to recognize the facial emotion of a human face from an image as a input. For this I leveraged a pre trained resnet 50 model to help with the image classification through the help of transfer learning. The model was trained on the emotion label as well as the FACS code which is a comprehensive, anatomically based system for describing all visually discernible facial movement.   ",
    "github": "https://github.com/Exynos13/Facial-Emotion-Prediction",
    "bgcolor": "#f85781",
    "id": "4"
  },

  {
    "title": "Stance Classification",
    "description": "Detection of stance from tweets",
    "image": "/projectImages/NLP.png",
    "image2": "/projectImages/Stance.png",
    "image3": "/projectImages/NLP2.png",
    "body": "Building a model to perform stance classification on tweets data i.e. to understand what is the stance of the author of the tweet to a particular target whether they are for it or against it. Base model used was using a transfer learning on the model glove-twitter-100 which was specially trained on twitter. Tuned for parameters as per the performance of the model",
    "technologies": ["NLP", "Machine Learning", "Transfer Learning", "Glove"],
    "github": "https://github.com/Exynos13/Stance_classification",
    "bgcolor": "#e47911",
    "id": "5"
  },

  {
    "title": "Recommender System",
    "description": "a KNN based recommender system using collaborative filtering method.",
    "image": "/projectImages/recommend1.png",
    "image2": "/projectImages/Recommendation.png",
    "image3": "/projectImages/Recommend.png",
    "technologies": ["Machine Learning", "Data Processing", "KNN"],
    "body": "The model built was able to handle the data disparity problem by making up data based on the user similarity while also introducing the item’s popularity weight into the computation of similarity. Whereas for new users the recommendataion by choosing the top most popular movie titiles by calculating the composite recommendation which is the product of the popularity of the movie and the mean rating. Thus presnting the user with the selection of top movies user might like.",
    "github": "https://github.com/Exynos13/KNN_based_Recommendation_system",
    "bgcolor": "#3e67ff",
    "id": "6"
  }
]
